wosayttn/M55M1BSP/SampleCode/StdDriver/HSUSBH_USBH_SPIM_Writer/main.c
    SPIM_DISABLE_CIPHER(SPIM0);

    SPIM_DISABLE_CACHE(SPIM0);

    if (SPIM_InitFlash(SPIM0, 1) != 0)            /* Initialized SPI flash                      */
    {
        printf("SPIM flash initialize failed!\n");

        while (1);
    }

    SPIM_ReadJedecId(SPIM0, idBuf, sizeof(idBuf), 1, 0);   /* read SPIM flash ID                   */
    printf("SPIM get JEDEC ID=0x%02X, 0x%02X, 0x%02X\n", idBuf[0], idBuf[1], idBuf[2]);

    usbh_core_init();                       /* initialize USB Host library                */
    usbh_umas_init();                       /* initialize USB mass storage driver         */
    usbh_pooling_hubs();                    /* monitor USB hub ports                      */

    f_chdrive(usbh_path);                   /* set default path                           */

    SPIM_DMADMM_InitPhase(SPIM0, &sWb03hRdCMD, SPIM_CTL0_OPMODE_PAGEREAD);
    SPIM_DMADMM_InitPhase(SPIM0, &sWb02hWrCMD, SPIM_CTL0_OPMODE_PAGEWRITE);

    for (;;)
    {
        usbh_pooling_hubs();

        printf(_T(">"));
        ptr = Line;

        get_line(ptr, sizeof(Line));

        switch (*ptr++)
        {

            case 'h':
            case '?':                           /* Show usage                                 */
                printf(
                    _T("l - List root directory files\n")
                    _T("w <file> <addr> - Write a file to SPIM flash. <addr> is an offset from SPIM flash base.\n")
                    _T("c <file> <addr> - Compare a file with SPIM flash. <addr> is an offset from SPIM flash base.\n")
                    _T("d <addr> <len> - Dump SPIM offset <addr> contents.\n")
                    _T("g <addr> - Branch to SPIM offset <addr> and execute.\n")
                );
                break;

            case 'l' :                          /* List root directory files                  */
                show_root_dir();
                break;

            case 'w' :                          /* w <file> <addr>                            */
                write_file_to_flash(ptr);       /* Write a file to SPIM flash.                */
                break;

            case 'c' :                          /* c <file> <addr>                            */
                compare_file_with_flash(ptr);   /* Compare a file with SPIM flash block.      */
                break;

            case 'd' :                          /* d <addr> <len>                             */
                dump_spim_flash(ptr);           /* Dump contents of a SPIM flash block.       */
                break;

            case 'g' :                          /* g <addr>                                   */
                go_to_flash(ptr);               /* Branch to SPIM flash offset <addr>         */
                break;
        }
    }
}
